[
  {
    "id": "b9dbb6d6-d343-4d83-ab3d-0d869820d46d",
    "title": "Senior Softwareentwickler Echtzeitsysteme (m/w/d)",
    "name": "Senior Softwareentwickler Echtzeitsysteme (m/w/d)",
    "company": "Rheinmetall",
    "location": "Zurich, Zurich, Switzerland",
    "description": "WOFÜR WIR SIE SUCHEN\n   \n\n  \n\n  \n\n* Technische Leitung eines Teams von 3\\-10 Entwicklern zur Entwicklung von Software für Feuerleitung und Effektorsteuerung\n* Verantwortung für den gesamten Life\\-Cycle der Software für Feuerleitung und Effektorsteuerung: Design, Implementierung, Test und Wartung\n* Spezifizieren der Software\\-Anforderungen und der Software\\-Architektur\n* Mitarbeit bei Systemanforderungen und Systemdesign\n* Unterstützung der Engineering\\-Abteilungen während aller Produktphasen\n\n\n WAS SIE MITBRINGEN SOLLTEN\n   \n\n  \n\n  \n\n* Erfolgreich abgeschlossenes Studium (ETH, FH oder TH) als Informatikingenieur (m/w/d)\n* Mehrjährige Berufserfahrung\n* Erfahrung in der erfolgreichen technischen Leitung von Softwareprojekten\n* Erfahrung mit verteilten Systemen\n* Vertiefte Kenntnisse in der Softwareentwicklung mit Ada im Real\\-Time Embedded Bereich und Software\\-Architektur\n* Sehr gute Deutsch– und Englischkenntnisse in Wort und Schrift\n* Schnelle Auffassungsgabe und Verständnis für komplexe Softwaresysteme, lösungsorientierte, innovative und selbständige Arbeitsweise\n\n\n WAS WIR IHNEN BIETEN\n   \n\n  \n\n  \n\n* Flexible Arbeitszeiten (Gleit\\- und Vertrauensarbeitszeit); Home\\-Office, wo möglich und sinnvoll\n* Sehr gute Sozialleistungen und ein erfolgsorientiertes Gehalt\n* Sofort ab Eintritt im Krankheitsfall erfolgt die volle Gehaltsfortzahlung (inkl. 13\\. Monatslohn) vom ersten bis max. zum 730\\. Tag\n* Mitarbeitervorteile eines Großkonzerns, z. B. betriebliche Altersvorsorge, Mitarbeiteraktienkaufprogramm und gratis Grippeimpfung\n* Förderung von bedarfsgerechter Weiterbildung\n* Personalrestaurant sowie externe Verpflegungs\\- und Einkaufsmöglichkeiten in der Nähe\n* Verschiedene Vergünstigungen (z.B. Versicherungsprodukte, Mobiltelefonabonnemente)\n* Individuelle interne sowie externe Personalentwicklungsmaßnahmen in Zusammenarbeit mit unserer Rheinmetall\\-Academy\n* Case Management und individuelle Sozialbetreuung\n* Arbeitsplatz wenige Gehminuten vom Bahnhof Zürich\\-Oerlikon entfernt, Bushaltestelle vor dem Haus\n\n\n KONTAKTDETAILS\n   \n\n  \n\n Zuständige/r Ansprechpartner/in: Jascha Köster\n   \n\n  \n\n Für Fragen zu Ihrer Bewerbung, nutzen Sie bitte das Kontaktformular.\n   \n\n  \n\n**Wir weisen darauf hin, dass Dossiers von Personalvermittlern nicht berücksichtigt werden.**",
    "url": "https://www.linkedin.com/jobs/view/4265462639",
    "category": "Engineering and Information Technology",
    "company_url": "https://de.linkedin.com/company/rheinmetall",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": "2025-12-12",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.882765",
    "search_term": "informatiker"
  },
  {
    "id": "33cc20af-9d34-4fda-9d76-4616adf95d52",
    "title": "Senior Software Engineer",
    "name": "Senior Software Engineer",
    "company": "Swiss Light Source",
    "location": "Villigen, Aargau, Switzerland",
    "description": "* PSI Home\n* Career \\& Education\n* Job Opportunities\n\n\n The Paul Scherrer Institute PSI is the largest research institute for natural and engineering sciences within Switzerland. We perform cutting\\-edge research in the fields of future technologies, energy and climate, health innovation and fundamentals of nature. By performing fundamental and applied research, we work on sustainable solutions for major challenges facing society, science and economy. PSI is committed to the training of future generations. Therefore, about one quarter of our staff are post\\-docs, post\\-graduates or apprentices. Altogether, PSI employs 2300 people.\n   \n\n  \n\n For Software Engineering \\- Backend, Controls Section, we are looking for a\n   \n\n  \n\n Senior Software Engineer\n   \n\n  \n\n 12\\.12\\.2025\n   \n\n  \n\n* 8212\\-25669\n* 100%\n\n\n Share Job\n   \n\n  \n\n* Facebook\n* LinkedIn\n* Mail\n* X (Twitter)\n\n\n Apply online now\n   \n\n  \n\n Your tasks\n   \n\n  \n\n* Lead the development of the full software stack for camera and detector data acquisition service\n* Collaborate with system integrators to ensure the software is deployable, providing them with robust interfaces for service management and monitoring\n* End\\-to\\-end management of the build and deployment lifecycle using Docker, Ansible, Git, CI/CD, and package management (Conan)\n* Actively document new and existing technical solutions (e.g. through specifications, test plans and procedures, user guides, technical reports and publications)\n\n\n Your profile\n   \n\n  \n\n* Degree in software engineering, computer science, or equivalent work experience\n* Extensive experience developing software in C\\+\\+ (Python or Rust is a plus)\n* Proficiency in structured software development workflows, including issue tracking, version control (Git), and CI/CD\n* Communicative, collaborative, self\\-motivated and customer\\-oriented personality who likes to work in a team\n* Good command of English, German, or readiness to learn is an advantage\n\n\n We offer\n   \n\n  \n\n Our institution is based on an interdisciplinary, innovative and dynamic collaboration. You will profit from a systematic training on the job, in addition to personal development possibilities and our pronounced vocational training culture. If you wish to optimally combine work and family life or other personal interests, we are able to support you with our modern employment conditions and the on\\-site infrastructure.\n   \n\n  \n\n For further information, please contact Tadej Humar, phone \\+41 56 310 55 28\\.\n   \n\n  \n\n Please submit your application online for the position as a Senior Software Engineer (Index\\-Nr. 8212\\-25669\\).\n   \n\n  \n\n Human Resources Management, Adrian Kirsch, 5232 Villigen PSI, Switzerland",
    "url": "https://www.linkedin.com/jobs/view/4327245166",
    "category": "Engineering and Information Technology",
    "company_url": "https://ch.linkedin.com/company/swiss-light-source",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": "2025-12-12",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.897779",
    "search_term": "informatiker"
  },
  {
    "id": "e3efe4ed-0dea-4509-a405-dc3a4850abdb",
    "title": "Teamleiter IT System Engineering (m/w) 80-100%",
    "name": "Teamleiter IT System Engineering (m/w) 80-100%",
    "company": "yellowshark® AG",
    "location": "Thalwil, Zurich, Switzerland",
    "description": "Die yellowshark AG ist dein zuverlässiger Partner für die Besetzung von langfristigen Festanstellungen. Mit unserer Erfahrung und Branchenvielfalt bieten wir passende Lösungen für Kandidaten und Unternehmen. Qualität vor Quantität ist unser Grundsatz, von dem nicht nur du als IT\\-Experte profitierst, sondern auch der Markt mit seinen spezifischen Anforderungen.\n   \n\n  \n\n Haben wir dein Interesse geweckt? Dann bewirb dich noch heute mit deinen vollständigen und aussagekräftigen Bewerbungsunterlagen. Wir freuen uns darauf, dich kennenzulernen!\n   \n\n  \n\n Bitte beachte, dass wir unvollständige Bewerbungsunterlagen leider nicht berücksichtigen können.\n   \n\n  \n\n**Aufgaben**\n* Fachliche und personelle Führung des System\\-Engineering\\-Teams\n* Sicherstellung des reibungslosen IT\\-Betriebs und Weiterentwicklung der Infrastruktur (mehrheitlich Windows\\-Umgebungen)\n* Verantwortung für Server\\-, Netzwerk\\- und Cloud\\-Systeme sowie IT\\-Security, Backup und Recovery\n* Planung und Umsetzung von Infrastruktur\\-, Migrations\\- und Modernisierungsprojekten\n* Enge Zusammenarbeit mit Kunden (vorwiegend öffentliche Verwaltungen) sowie mit internen und externen Partnern\n* Mitarbeit im operativen Betrieb und bei technischen Projekten\n* Mitwirkung bei der strategischen Weiterentwicklung der IT\\-Services und Beratung der Geschäftsleitung\n\n\n**Profil**\n* Abgeschlossene Ausbildung als Informatiker EFZ Systemtechnik, idealerweise mit zusätzlicher IT\\-Weiterbildung auf Stufe HF/FH\n* Mehrjährige Erfahrung im System\\- und Infrastrukturumfeld\n* Erfahrung in der Teamführung im IT System Engineering\n* Fundiertes Know\\-how in: Windows Server / Active Directory, Virtualisierung (z. B. VMware), Netzwerk (LAN/WAN, Firewall, Routing, VPN), Microsoft 365 / Azure, IT\\-Security \\& Backup\\-Lösungen\n* Dienstleistungsorientierte, integre und lösungsorientierte Persönlichkeit mit Organisationstalent\n* Freude an der Zusammenarbeit mit Kunden aus dem öffentlichen Bereich\n* Stilsichere Deutschkenntnisse (C2\\) und gute Englischkenntnisse (B2\\)\n* Im Besitz des Führerausweises Kat. B\n\n\n**Wissenswertes**\n* Verantwortungsvolle Führungsfunktion mit Gestaltungsspielraum\n* Engagiertes, kompetentes Team in einem modernen Arbeitsumfeld\n* Sinnstiftende Projekte mit Fokus auf den öffentlichen Sektor\n* Attraktive und zeitgemässe Arbeitsbedingungen\n* Moderne Infrastruktur, Weiterbildungsmöglichkeiten und flexible Arbeitsmodelle",
    "url": "https://www.linkedin.com/jobs/view/4331405841",
    "category": "Information Technology",
    "company_url": "https://ch.linkedin.com/company/yellowshark-ag",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": "2025-12-12",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.906230",
    "search_term": "informatiker"
  },
  {
    "id": "a3b38e33-3b45-42f3-af1a-aec127e9613b",
    "title": "Senior Softwareentwickler (m/w/d)",
    "name": "Senior Softwareentwickler (m/w/d)",
    "company": "Dr.-Ing. Paul Christiani GmbH & Co. KG",
    "location": "Constance, Baden-Württemberg, Germany",
    "description": "Bildung ist das, was Sie mitbringen. Freiraum zum Lernen und Wachsen das, was Sie bei Christiani bekommen. Als Pioniere der technischen Aus\\- und Weiterbildung bieten wir Ihnen beste Voraussetzungen, Ihr Wissen einzubringen und Ihr Können auszubauen. Für eine Welt, in der wir lebenslang lernen können. Gemeinsam mit – und von Ihnen.\n \n\n\n  \n\n Aufgaben\n   \n\n  \n* Fachliche Leitung sowie Entwicklung eines engagierten Softwareentwicklungsteams\n  \n* Konzeption und kontinuierliche Optimierung agiler Prozesse (Scrum, Kanban) inkl. Einsatz von Tools wie Jira\n  \n* Verantwortung für die Weiterentwicklung skalierbarer Softwarearchitekturen und Sicherstellung sauberer, wartbarer Codequalität\n  \n* Enge Zusammenarbeit mit Produktmanagement, Projektleitung und anderen Stakeholdern zur zielgerichteten Umsetzung technischer Anforderungen\n  \n* Aufbau einer offenen, feedbackorientierten Teamkultur mit Fokus auf Eigenverantwortung, Qualität und Weiterentwicklung\n  \n\n\n  \n\n Qualifikation\n   \n\n  \n* Erfolgreich abgeschlossenes Studium im Bereich Informatik oder einer vergleichbaren Fachrichtung\n  \n* Mindestens 5 Jahre Berufserfahrung in der professionellen Softwareentwicklung und Teamleitung in agilen Umgebungen\n  \n* Erfahrung in der Projektleitung/Projektverantwortung\n  \n* Fundierte Erfahrung in der Fullstack\\-Entwicklung mit mehreren der folgenden Technologien: Java, C/C\\+\\+, C\\#, Java\\-Script, PostgreSQL, SQL, TypeScript, HTML/CSS, Angular\n  \n* Erfahrung im Umgang mit gängigen Datenbanken wie PostgreSQL, Microsoft SQL\n  \n* Vertraut im Umgang mit OSGi / Eclipse RCP sowie mit moderner UI\\-/UX\\-Gestaltung (wünschenswert)\n  \n* Sehr gute Deutsch\\- und Englischkenntnisse in Wort und Schrift\n  \n\n\n  \n\n Benefits\n   \n\n  \n* ein strukturierter Onboarding\\-Prozess\n  \n* moderne Geschäftsaustattung inklusive Mobiltelefon\n  \n* Hansefit\\-Firmenfitness\n  \n* Dienstradleasing über Eurorad\n  \n* flexible Arbeitszeitmodelle sorgen für eine ausgeglichene Work\\-Life\\-Balance\n  \n* wirkliche Vereinbarkeit von Familie und Beruf\n  \n* regelmäßige Firmenevents für optimales Teambuilding\n  \n* wir setzen uns für Offenheit, Diversität, Vertrauen und Engagement in unserem Team ein\n  \n* Faires Gehalt mit Sondervergütungen, Fahrtkostenzuschuss und betrieblichen Sozialleistungen\n  \n* Förderung der betrieblichen Altersvorsorge\n  \n* kostenlose Kaltgetränke und Kaffeespezialitäten\n  \n* Zuschuss zum warmen Mittagessen\n  \n* freiwillige Teilnahme an verschiedenen Laufveranstaltungen und Gesundheitskursen\n  \n* kostenlose Parkplätze und optimale Anbindung an öffentliche Verkehrsmittel\n  \n* Mittagspause am See – arbeiten wo andere Urlaub machen\n  \n\n\n  \n\n\n Wir freuen uns auf Ihre Bewerbung!",
    "url": "https://www.linkedin.com/jobs/view/4349685684",
    "category": "Information Technology",
    "company_url": "https://de.linkedin.com/company/christiani-gmbh",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": "2025-12-12",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.912168",
    "search_term": "informatiker"
  },
  {
    "id": "bead5eb7-63c3-4937-8627-fb178e4e9d48",
    "title": "Senior Software-Ingenieur/BizDevOps Engineer",
    "name": "Senior Software-Ingenieur/BizDevOps Engineer",
    "company": "RM Group (Switzerland)",
    "location": "Zurich, Zurich, Switzerland",
    "description": "Gefällt Ihnen dieser Job? Dann bewerben Sie sich jetzt.\n   \n\n  \n\n**Senior Software\\-Ingenieur/BizDevOps Engineer** \n Position bei einem agierenden Unternehmen aus der Technologiebranche in Switzerland zu besetzen.\n   \n\n  \n\n**Ihre Aufgaben**\n* Design, Entwicklung, Test und Betrieb von Anwendungen in Java, Kotlin / Spring Boot \\& Typescript/Angular\n* Konzeption und Lösungserarbeitung neuer Funktionalitäten inkl. der Erstellung von Aufwandschätzungen\n* Verantwortung der E2E Umsetzung (Analyse, Implementation, Test und Betrieb) von Feature/Applikationen\n* Sicherstellen des reibungslosen Applikations\\-Betriebes in einer komplexen Systemlandschaft (DevOps)\n* Mitarbeit als Teamplayer in einer agilen Arbeitsorganisation gestaltet nach SAFe und geprägt durch einen hohen Grad an Selbstverantwortung\n\n\n**Ihre Kenntnisse**\n* Abgeschlossenes Informatikstudium (ETH, Uni, FH) oder äquivalente Ausbildung\n* Nachweislich mehrjährige Erfahrung mit professioneller Software\\-Entwicklung\n* Fundiertes Wissen über Software\\-Architektur, Design\\-Patterns sowie verteilte Systeme\n* Sehr versiert im Umgang und der Lösungsfindung von komplexen, auch mathematischen Problemstellungen\n* Sehr gute Erfahrung mith Java, Kotlin / Spring Boot and Typescript/Angular\n* Schnelles Aufnahmevermögen, besonders über fachlich \\& technisch komplexe Systeme\n* Hohe Team\\- und Qualitätsorientierung\n* Vertieftes Wissen im Bereich Graphen\\-Theorie und mathematischer Optimierungen, konkret Mixed\\-Integer\\-Linear\\-Programming (zB. mit Gurobi), von grossem Vorteil\n* Sprachen: Deutsch\n\n\n**Das Zeichnet Sie Aus**\n* Ausgezeichnete Auffassungsgabe mit Liebe zum Detail\n* Ein hohes Mass an Selbstorganisation und Zeitmanagement\n* Analytisches und lösungsorientiertes Denken\n\n\n**Ort:** \n Bern, Schweiz\n **Arbeitsmodell:** \n Hybrid\n **Sektor:** \n Technologiebranche\n **Start:** \n Per sofort\n **Projektdauer:** \n 12 Monate\n **Pensum:** \n 100%\n **Ref** \n**.Nr.:** \n BH 23734\n   \n\n  \n\n Machen Sie den nächsten Schritt und senden Sie uns Ihren Lebenslauf sowie eine Telefonnummer, unter der wir Sie tagsüber erreichen können.\n   \n\n  \n\n**Aufgrund der schweizerischen Arbeitsgesetzgebung können wir nur Bewerbungen von Schweizer Staatsbürgern, EU\\-Bürgern und Personen mit einer Arbeitserlaubnis in Betracht ziehen.**\n Wir begrüssen Bewerbungen von Personen aller Geschlechter, Altersgruppen im erwerbsfähigen Alter, sexuellen Orientierungen, persönlichen Ausdrucksformen, ethnischen Zugehörigkeiten und religiösen Überzeugungen. Daher sind Angaben zum Geschlecht oder ein Foto in Ihrer Bewerbung nicht erforderlich.\n   \n\n  \n\n Aufgrund von Kundenanforderungen benötigen wir Informationen zu Ihrem Familienstand, Ihrer Staatsangehörigkeit, Ihrem Geburtsdatum sowie einer gültigen Schweizer Arbeitsbewilligung. Bei Bewerbern mit Behinderungen sind wir gerne bereit, gemeinsam mit unserem Endkunden mögliche Lösungen zu prüfen",
    "url": "https://www.linkedin.com/jobs/view/4327152563",
    "category": "Engineering and Information Technology",
    "company_url": "https://ch.linkedin.com/company/rm-group-switzerland",
    "emails": [],
    "job_type": "contract",
    "is_remote": false,
    "date_posted": "2025-12-12",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.918014",
    "search_term": "informatiker"
  },
  {
    "id": "ac4cf02a-4efc-4ecb-8991-e2c129b7acb0",
    "title": "Senior Software Engineer / Team Lead / Solution Architect (Backend, Kotlin, Microservices)",
    "name": "Senior Software Engineer / Team Lead / Solution Architect (Backend, Kotlin, Microservices)",
    "company": "Sitasys AG",
    "location": "Gäu, Solothurn, Switzerland",
    "description": "Company Overview:\n \n\n\n\n Sitasys AG is a leading provider of cloud\\-based security management solutions. Our product, evalink, is transforming the alarm management industry with a fully managed, automated SaaS ecosystem. We are expanding our R\\&D leadership capacity to execute complex development projects closely aligned with our product roadmap.\n \n\n\n\n  \n\n\n\n\n\n Job Summary:\n \n\n\n\n We are seeking a Senior Software Engineer / Team Lead / Solution Architect to take ownership of critical customer and internal projects. This role combines technical leadership, hands\\-on development, and cross\\-functional collaboration with product management.\n \n\n\n\n The successful candidate will guide and manage a development team in Istanbul while working directly with the product leadership team in Switzerland to ensure projects are delivered in line with strategic goals.\n \n\n\n\n  \n\n\n\n\n\n Key Responsibilities:\n \n\n\n* Take technical ownership of complex projects, including customer\\-specific integrations and core platform development.\n* Lead and mentor the development team in Istanbul, providing guidance, code reviews, and architectural oversight.\n* Define and maintain scalable, secure microservices architectures, primarily using Kotlin.\n* Work closely with product management to translate product roadmap items into executable technical plans.\n* Ensure alignment between product vision, technical execution, and project deliverables.\n* Support continuous improvement in development processes and team collaboration.\n\n\n\n  \n\n\n\n\n\n Requirements:\n \n\n\n* Bachelor’s degree in Computer Science, Engineering, or a related field.\n* Fluent in Turkish and English (written and spoken).\n* German skills are a plus, but not required.\n* 10\\+ years of experience in backend development\n* Experience with Java and KotlinHands\\-on experience with AWS deployments\n* Proven experience with microservices architectures and distributed systems.\n* Strong analytical skills and problem\\-solving capabilities.\n* Excellent people management and communication skills, with a passion for mentoring and leading teams.\n* Experience in the security industry (alarm management, monitoring, access control, etc.) is an advantage but not mandatory.\n\n\n\n  \n\n\n\n\n\n Why Join Us:\n \n\n\n* Work on innovative, mission\\-critical systems in the security industry.\n* Take a leading role in shaping the technical direction of high\\-impact projects.\n* Collaborate with an international, highly skilled team in Switzerland and Turkey.\n* Contribute to a fast\\-growing SaaS platform with cutting\\-edge architecture.\n\n\n\n  \n\n\n\n\n\n Location \\& Travel:\n \n\n\n* This position is based in Switzerland (Langendorf).\n* Occasional travel to Istanbul may be required for team collaboration.",
    "url": "https://www.linkedin.com/jobs/view/4343352823",
    "category": "Engineering and Information Technology",
    "company_url": "https://ch.linkedin.com/company/sitasys-ag",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": "2025-12-12",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.924915",
    "search_term": "informatiker"
  },
  {
    "id": "124628ef-ecdd-4a77-a61c-593d459d70a7",
    "title": "IT-Systemtechniker - Client-, Server- und Netzwerkbetrieb (m/w/d)",
    "name": "IT-Systemtechniker - Client-, Server- und Netzwerkbetrieb (m/w/d)",
    "company": "Rocken®",
    "location": "Schaffhausen, Schaffhausen, Switzerland",
    "description": "Unser ROCKEN Partner ist ein renommiertes IT\\-Dienstleistungsunternehmen, das sich auf die Bereitstellung von Lösungen aus dem umfassenden Produktangebot von Microsoft spezialisiert hat. Unsere Expertise umfasst unter anderem Virtualisierung, Firewall\\-Einrichtung und Netzwerkinstallation. Mit einem ganzheitlichen Ansatz planen, realisieren und betreiben wir IT\\-Infrastrukturen sowohl vor Ort als auch in der Cloud, wobei wir eng mit den innovativen Technologien von Microsoft zusammenarbeiten.\n   \n\n  \n\n**Verantwortung**\n* Betrieb, Wartung und Weiterentwicklung von Client\\-, Server\\- und Netzwerkinfrastrukturen im Microsoft\\-Umfeld – vor Ort, remote oder intern\n* Vorbereitung, Installation und Konfiguration von Hardware und Standardsoftware\n* Selbstständige Analyse und Behebung von Störungen sowie Bearbeitung eingehender Serviceaufträge\n* Beratung und technische Unterstützung der Kunden in sämtlichen IT\\-Belangen, inklusive Verkauf und Betreuung von Hard\\- und Softwarelösungen\n* Unterstützung bei administrativen Aufgaben wie Sortimentspflege, Bestellungen, Kassenabrechnungen, Offertenerstellung und Warenpräsentation\n\n\n**Qualifikationen**\n* Abgeschlossene Ausbildung als Informatiker EFZ oder gleichwertige Qualifikation\n* Erfahrung im IT\\-Support und in der Systemadministration\n* Gute Kenntnisse in Windows\\- und/oder Linux\\-Umgebungen\n* Vertraut mit Netzwerktechnologien wie LAN, WLAN, VPN und Firewall\n* Selbstständige, zuverlässige und lösungsorientierte Arbeitsweise\n* Sehr gute Deutschkenntnisse in Wort und Schrift, Englischkenntnisse von Vorteil\n\n\n**Benefits**\n* Attraktive Leistungen bei Krankheit oder Unfall\n* Attraktive Weiterbildungs\\- und Entwicklungsmöglichkeiten\n\n\n**ROCKEN Jobs**\n https://rocken.jobs\n   \n\n  \n\n**Profil Erstellen**\n https://rocken.jobs/application/profil\\-erstellen/\n   \n\n  \n\n* new",
    "url": "https://www.linkedin.com/jobs/view/4327000083",
    "category": "Information Technology",
    "company_url": "https://ch.linkedin.com/company/rockenjobs",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": true,
    "date_posted": "2025-12-12",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.932385",
    "search_term": "informatiker"
  },
  {
    "id": "063e24a2-1570-47f9-8443-a92f8b5fbdaa",
    "title": "Informatiker (m/w/d)",
    "name": "Informatiker (m/w/d)",
    "company": "Rocken®",
    "location": "Zurich, Zurich, Switzerland",
    "description": "**Verantwortung**\n* Du planst und steuerst ICT\\-Projekte im Soft\\- und Hardwarebereich und gestaltest die Weiterentwicklung unserer IT\\-Landschaft aktiv mit.\n* Du übernimmst Supportaufgaben auf 1st\\- und 2nd\\-Level\\-Niveau, löst Anfragen effizient und sorgst für stabile ICT\\-Services.\n* Du administrierst Geräte über Jamf Pro und Intune und stellst sicher, dass Deployments, Updates und Konfigurationen reibungslos erfolgen.\n* Du betreust ICT\\- und Multimedia\\-Infrastrukturen, unterstützt Netzwerkaufgaben und arbeitest eng mit anderen Teams zusammen.\n\n\n**Qualifikationen**\n* Du hast eine Informatikausbildung EFZ oder eine gleichwertige Ausbildung abgeschlossen und verfügst über fundierte Kenntnisse in der M365\\-Umgebung.\n* Du besitzt idealerweise Erfahrung mit Multimedia\\-Technik und bringst Grundwissen im Netzwerkbereich mit.\n* Du arbeitest zuverlässig, engagiert, kundenorientiert und kommunizierst klar im Team sowie mit Anwender:innen.\n* Du bist lernbereit, technisch versiert und motiviert, neue Tools und Technologien schnell zu beherrschen.\n\n\n**ROCKEN Jobs**\n https://rocken.jobs\n   \n\n  \n\n**Profil Erstellen**\n https://rocken.jobs/application/profil\\-erstellen/\n   \n\n  \n\n* new",
    "url": "https://www.linkedin.com/jobs/view/4326709266",
    "category": "Research, Analyst, and Information Technology",
    "company_url": "https://ch.linkedin.com/company/rockenjobs",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": "2025-12-11",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.938591",
    "search_term": "informatiker"
  },
  {
    "id": "0bfe0b9c-543c-4622-b7a0-2fee76aa4677",
    "title": "IT System Specialist - Windows Client / Server (m/w/d)",
    "name": "IT System Specialist - Windows Client / Server (m/w/d)",
    "company": "Rocken®",
    "location": "Zug, Zug, Switzerland",
    "description": "**Lohn \\- CHF80'000 \\- 100'000**\n**Rolle**\n Eine vielseitige Position in der IT\\-Infrastruktur wartet auf eine engagierte Fachperson mit technischem Know\\-how und Freude an Kundenprojekten.\n   \n\n  \n\n**Verantwortung**\n* Planung, Konfiguration und Betrieb von MS Windows Client/Server Umgebungen\n* Unterstützung des Verkaufs bei der Konzeption von Kundenlösungen\n* Mitwirkung in Projekten von der Planung bis zur technischen Umsetzung\n* Betreuung und Weiterentwicklung der internen Infrastruktur inklusive Microsoft 365\n* Verwaltung von Virtualisierungslösungen (Hyper\\-V, VMware)\n* Bearbeitung technischer Supportanfragen (2nd Level)\n\n\n**Qualifikationen**\n* Abgeschlossene Ausbildung als Informatiker EFZ oder gleichwertig\n* Erfahrung in Windows Client/Server\\-Umgebungen und Microsoft 365\n* Kenntnisse in Virtualisierung (z.B. VMware, HyperV) und Interesse an IT\\-Security\n* Kundenorientiertes Auftreten und strukturierte Arbeitsweise\n* Sprache: Deutsch fliessend, Englischkenntnisse von Vorteil\n\n\n**ROCKEN Jobs**\n https://rocken.jobs\n   \n\n  \n\n**Profil Erstellen**\n https://rocken.jobs/application/profil\\-erstellen/\n   \n\n  \n\n* new",
    "url": "https://www.linkedin.com/jobs/view/4326796421",
    "category": "Information Technology",
    "company_url": "https://ch.linkedin.com/company/rockenjobs",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": "2025-12-11",
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.944313",
    "search_term": "informatiker"
  },
  {
    "id": "9f0cc80a-b25b-424b-ad67-a590f0708801",
    "title": "Senior Software Engineer",
    "name": "Senior Software Engineer",
    "company": "PSI Laboratory for Energy Systems Analysis (LEA)",
    "location": "Villigen, Aargau, Switzerland",
    "description": "The Paul Scherrer Institute PSI is the largest research institute for natural and engineering sciences within Switzerland. We perform cutting\\-edge research in the fields of future technologies, energy and climate, health innovation and fundamentals of nature. By performing fundamental and applied research, we work on sustainable solutions for major challenges facing society, science and economy. PSI is committed to the training of future generations. Therefore, about one quarter of our staff are post\\-docs, post\\-graduates or apprentices. Altogether, PSI employs 2300 people.\n   \n\n  \n\n For Software Engineering \\- Backend, Controls Section, we are looking for a\n   \n\n  \n\n Senior Software Engineer\n   \n\n  \n\n 12\\.12\\.2025\n   \n\n  \n\n* 8212\\-25669\n* 100%\n\n\n Share Job\n   \n\n  \n\n* Facebook\n* LinkedIn\n* Mail\n* X (Twitter)\n\n\n Apply online now\n   \n\n  \n\n Your tasks\n   \n\n  \n\n* Lead the development of the full software stack for camera and detector data acquisition service\n* Collaborate with system integrators to ensure the software is deployable, providing them with robust interfaces for service management and monitoring\n* End\\-to\\-end management of the build and deployment lifecycle using Docker, Ansible, Git, CI/CD, and package management (Conan)\n* Actively document new and existing technical solutions (e.g. through specifications, test plans and procedures, user guides, technical reports and publications)\n\n\n Your profile\n   \n\n  \n\n* Degree in software engineering, computer science, or equivalent work experience\n* Extensive experience developing software in C\\+\\+ (Python or Rust is a plus)\n* Proficiency in structured software development workflows, including issue tracking, version control (Git), and CI/CD\n* Communicative, collaborative, self\\-motivated and customer\\-oriented personality who likes to work in a team\n* Good command of English, German, or readiness to learn is an advantage\n\n\n We offer\n   \n\n  \n\n Our institution is based on an interdisciplinary, innovative and dynamic collaboration. You will profit from a systematic training on the job, in addition to personal development possibilities and our pronounced vocational training culture. If you wish to optimally combine work and family life or other personal interests, we are able to support you with our modern employment conditions and the on\\-site infrastructure.\n   \n\n  \n\n For further information, please contact Tadej Humar, phone \\+41 56 310 55 28\\.\n   \n\n  \n\n Please submit your application online for the position as a Senior Software Engineer (Index\\-Nr. 8212\\-25669\\).\n   \n\n  \n\n Human Resources Management, Adrian Kirsch, 5232 Villigen PSI, Switzerland",
    "url": "https://www.linkedin.com/jobs/view/4327156336",
    "category": "Engineering and Information Technology",
    "company_url": "https://ch.linkedin.com/company/psi-lea",
    "emails": [],
    "job_type": "fulltime",
    "is_remote": false,
    "date_posted": null,
    "compensation": null,
    "saved_at": "2025-12-13T22:37:47.950602",
    "search_term": "informatiker"
  }
]